app/controllers/events_controller.rb

      def show
        id = params[:id]
        @event = Event.find(id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]

      def index
        @events = Event.all
---
SELECT "events".* FROM "events" WHERE (Tags in('Business','Career Fair','Computer Science','Others','Speech'))  ORDER BY id

      def create
        #@event = Event.create!(event_params)
        #@event.update(creator_id: session[:user_id])
        #flash[:notice] = "#{@event.title} was successfully created."
        begin
          @event = Event.create!(event_params)
---
INSERT INTO "events" ("title", "location", "tag", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "k"], ["location", "k"], ["tag", "Computer Science"], ["date", "2023-11-01 00:00:00.000000"], ["created_at", "2023-11-01 23:59:17.502861"], ["updated_at", "2023-11-01 23:59:17.502861"]]

      def edit
        @event = Event.find params[:id]
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

      def update
        @event = Event.find params[:id]

        begin
          @event.update_attributes!(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["date", "2023-10-26 00:00:00.000000"], ["updated_at", "2023-11-15 19:22:20.719660"], ["id", 1]]