app/controllers/following_controller.rb

    def index
      #@sort_by = sort_by
      followees = Follow.where(follower: session[:user_id]).pluck(:followee)
---
SELECT "follows"."followee" FROM "follows" WHERE "follows"."follower" = ?  [["follower", 3]]