app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "ffff"]]
---
    def create
        user_name = user_params[:user_name]
        password = user_params[:password]
        user = User.find_by(user_name:user_name)