app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
    def index
        if session[:user_id]
            @user = User.find session[:user_id]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "activity_user_relations".* FROM "activity_user_relations" WHERE "activity_user_relations"."user_id" = ?  [["user_id", 3]]
---
    def show
        @session_id = session[:user_id]
        @id = params[:id].to_i
        @user = User.find(@id)
        @relations = ActivityUserRelation.where(user_id: @session_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @user = User.find session[:user_id]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$Qe7X2KxK9NqbE7mp7fL9teBAMdWS.bBIl65O4aY7xcTGX2gwJ6BzK"], ["id", 1]]
---
  def update
    @user = User.find session[:user_id]
    @user.update_attributes!(user_params)

INSERT INTO "users" ("user_name", "first_name", "last_name", "password_digest") VALUES (?, ?, ?, ?)  [["user_name", "jqin"], ["first_name", "Jingyue"], ["last_name", "Qin"], ["password_digest", "$2a$12$MQxzzG9fTr9bhdmWEqHQTuqfMJ/slH..qAZw7rQHj7l5FIDHpaMUG"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy
        @user = User.find(session[:user_id])
        @user.destroy